/*******************************************************************************
 *
 * Copyrigth(C), 2002-2005,Sanxing Tech,Co.,Ltd.
 * Filename: uart.h
 * Version: V1.0
 * Description: 串口控制.
 *
 modification history
---------------------
* $Log: uart.h,v $
* Revision 1.1  2011-05-06 01:01:09  jghuang
* lm1911 bootloader调试通过
*
*
*******************************************************************************/

#ifndef __BL_UART_H__
#define __BL_UART_H__

#ifdef __cplusplus            /* Maintain C++ compatibility */
extern "C"
{
#endif /* __cplusplus */

/*------------------------------------------------------------------------------
Section: Includes
------------------------------------------------------------------------------*/
#include <types.h>

/*------------------------------------------------------------------------------
Section: Function Prototypes
------------------------------------------------------------------------------*/
/*******************************************************************************
*
* uart_init - uart初始化
*
*
* INPUTS: 
*   void
*
* RETURNS:
*   void
*
*******************************************************************************/
extern void uart_init(void);

/*******************************************************************************
*
* uart_send - 发送指定长度的数据
*
* INPUTS: 
*   const uint8 c : 要发送的字符
*
* RETURNS:
*   void
*
*******************************************************************************/
extern void uart_send(const uint8 c);

/*******************************************************************************
*
* uart_receive - 接收指定长度的数据
*
* INPUTS: 
*   pData : 接收缓冲
*   size  : 接收长度
*
* RETURNS:
*   void
*
*******************************************************************************/
extern void uart_receive(uint8 *pData, uint32 size);

/*******************************************************************************
*
* uart_tryReceive - 尝试接收1个字符
*
* INPUTS: 
*   pData : 接收缓冲
*
* RETURNS:
*   boolean : true-有数据 false-无数据.
*
*******************************************************************************/
extern boolean uart_tryReceive(uint8 *pData);

#ifdef __cplusplus /* Maintain C++ compatibility */
} 
#endif /* __cplusplus */

#endif /*__BL_UART_H__ */

/*--------------------------------End of uart.h-------------------------------*/
